Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.SlantedColumnEndsHaveSameHeight
The first click elevation (combination of level and offset) cannot be equal to the second click elevation (combination of level and offset).